#+TITLE: sparcur developer guide
#+AUTHOR: Tom Gillespie
#+OPTIONS: num:nil ^:nil h:7
#+LATEX_HEADER: \usepackage[margin=0.8in]{geometry}
#+STARTUP: showall

# [[file:developer-guide.pdf]]
# [[file:developer-guide.html]]

** Validate a dataset
You can run this example block and it will validate the [[file:../resources/DatasetTemplate][DatasetTemplate]].

# #+header: :epilogue "import pprint; return pprint.pformat(data.keys())"
#+header: :epilogue "import pprint; return pprint.pformat(data)"
#+begin_src python :results drawer :exports both :cache yes :tangle ./broken.py
from sparcur import pipelines as pipes
from sparcur.paths import Path as basePath


def makeValidator(dataset_path):

    class Path(basePath):
        """ Workaround absense of cache. """

        # TODO likely will also need to rebind the cache class as well

        @property
        def dataset_relative_path(self, __drp=dataset_path):
            return self.relative_path_from(self.__class__(__drp))

    Path._bind_flavours()

    # XXX monkey patch TODO sigh FIXME DatasetStructure calls Path directly inside
    basePath.dataset_relative_path = Path.dataset_relative_path

    dataset_path = Path(dataset_path)

    class context:
        path = dataset_path.resolve()
        id = path.id
        uri_api = path.as_uri()
        uri_human = path.as_uri()

    class lifters:
        id = context.id
        folder_name = context.path.name
        uri_api = context.uri_api
        uri_human = context.uri_human
        timestamp_export_start = None

    return pipes.SDSPipeline(dataset_path, lifters, context)


path = basePath('../resources/DatasetTemplate')
pipeline = makeValidator(path)
data = pipeline.data
#+end_src

#+RESULTS[99f2d5eba83acdff6934d4fdfe64da4170348550]:
:results:
:end:

